betaflight/betaflight/src/platform/common/stm32/can_hw.c
/*
 * This file is part of Betaflight.
 *
 * Betaflight is free software. You can redistribute this software
 * and/or modify this software under the terms of the GNU General
 * Public License as published by the Free Software Foundation,
 * either version 3 of the License, or (at your option) any later
 * version.
 *
 * Betaflight is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 *
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public
 * License along with this software.
 *
 * If not, see <http://www.gnu.org/licenses/>.
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "platform.h"

#if ENABLE_CAN

// Driver supports the Bosch M_CAN IP as implemented on G4 / H7 / C5.
// Other families either lack FDCAN (e.g. F4 / F7) or use a different IP
// revision that this driver has not been ported to yet. Fail loud at
// compile time if ENABLE_CAN is forced on elsewhere, rather than silently
// producing a non-functional build where TX would accept frames but do
// nothing.
#if !defined(STM32G4) && !defined(STM32H7) && !defined(STM32C5)
#error "ENABLE_CAN is set but the target MCU family has no FDCAN support in this driver"
#endif

#include "common/utils.h"

#include "drivers/can/can.h"
#include "drivers/can/can_impl.h"
#include "drivers/io.h"
#include "drivers/nvic.h"
#include "drivers/resource.h"
#include "platform/rcc.h"

//-----------------------------------------------------------------------------
// Message RAM layout
//
// All currently supported families (G4, H7, C5) expose the same Bosch M_CAN
// IP and share a dedicated Message RAM (CAN SRAM) at SRAMCAN_BASE. The
// significant difference is *who* picks the layout:
//
//   - G4 and C5: layout is fixed by silicon. Each FDCAN instance owns a
//     region of SRAMCAN_SIZE bytes at SRAMCAN_BASE + N*SRAMCAN_SIZE; the
//     sub-ranges (filters, FIFOs, Tx buffers) are at hardwired offsets
//     within the region. We only have to match the SDK's assumed element
//     counts and sizes when addressing the RAM.
//
//   - H7: layout is software-defined. We partition the shared RAM and
//     program the start-address / element-count / element-size into each
//     instance's SIDFC/XIDFC/RXF0C/RXF1C/RXBC/TXEFC/TXBC and RXESC/TXESC
//     registers. The driver hands out a fixed-size slice to each instance
//     using a per-instance word offset; within each slice we only use
//     Rx FIFO 0 and the Tx FIFO, and pick the smallest element size
//     (8-byte data) since this driver currently targets classic CAN.
//
// To keep the Tx / Rx element access paths identical across families, both
// configurations use a 4-word slot layout:
//
//   word 0: identifier + XTD flag
//   word 1: DLC (+ classic CAN flags, zero for now)
//   word 2: data[0..3]
//   word 3: data[4..7]
//
// On G4/C5 the hardware reserves 18 words per element (enough for FD
// 64-byte payloads); we just leave words 4..17 unused. On H7 we select
// element size code 0b000 = 8-byte data which gives a natural 4-word
// element.
//-----------------------------------------------------------------------------

#if defined(STM32G4) || defined(STM32C5)

// Element counts mirror ST's HAL private constants so the fixed offsets we
// compute below match the silicon layout.
#define CAN_SRAM_FLS_NBR    (28U)
#define CAN_SRAM_FLE_NBR    (8U)
#define CAN_SRAM_RF0_NBR    (3U)
#define CAN_SRAM_RF1_NBR    (3U)
#define CAN_SRAM_TEF_NBR    (3U)
#define CAN_SRAM_TFQ_NBR    (3U)

#define CAN_SRAM_FLS_SIZE   (1U * 4U)           // standard filter element
#define CAN_SRAM_FLE_SIZE   (2U * 4U)           // extended filter element
#define CAN_SRAM_RF_SIZE    (18U * 4U)          // Rx FIFO element (header + 64B)
#define CAN_SRAM_TEF_SIZE   (2U * 4U)           // Tx event FIFO element
#define CAN_SRAM_TFQ_SIZE   (18U * 4U)          // Tx FIFO element

#define CAN_SRAM_FLSSA      (0U)
#define CAN_SRAM_FLESA      (CAN_SRAM_FLSSA + CAN_SRAM_FLS_NBR * CAN_SRAM_FLS_SIZE)
#define CAN_SRAM_RF0SA      (CAN_SRAM_FLESA + CAN_SRAM_FLE_NBR * CAN_SRAM_FLE_SIZE)
#define CAN_SRAM_RF1SA      (CAN_SRAM_RF0SA + CAN_SRAM_RF0_NBR * CAN_SRAM_RF_SIZE)
#define CAN_SRAM_TEFSA      (CAN_SRAM_RF1SA + CAN_SRAM_RF1_NBR * CAN_SRAM_RF_SIZE)
#define CAN_SRAM_TFQSA      (CAN_SRAM_TEFSA + CAN_SRAM_TEF_NBR * CAN_SRAM_TEF_SIZE)
#define CAN_SRAM_PER_INSTANCE \
                            (CAN_SRAM_TFQSA + CAN_SRAM_TFQ_NBR * CAN_SRAM_TFQ_SIZE)

#define CAN_RX_ELEMENT_BYTES    CAN_SRAM_RF_SIZE
#define CAN_TX_ELEMENT_BYTES    CAN_SRAM_TFQ_SIZE

#elif defined(STM32H7)

// H7 layout (software-defined). Values are in *elements* or *bytes* as noted.
// Per-instance RAM reservation in WORDS (1 word = 4 bytes):
//  - 3 Rx FIFO 0 slots × 4 words = 12 words
//  - 3 Tx FIFO slots  × 4 words = 12 words
//  Round to a fixed 64-word (256-byte) slice per instance to leave head-room
//  for future additions (extra FIFOs, filters). Total usage with 3 instances
//  is 192 words / 768 bytes out of the 10 KiB of shared Message RAM.
#define CAN_H7_RF0_NBR              (3U)
#define CAN_H7_TFQ_NBR              (3U)
#define CAN_H7_ELEMENT_WORDS        (4U)        // 2 hdr + 8-byte data
#define CAN_H7_PER_INSTANCE_WORDS   (64U)
#define CAN_H7_RF0_WORD_OFFSET      (0U)
#define CAN_H7_TFQ_WORD_OFFSET      (CAN_H7_RF0_WORD_OFFSET + \
                                     CAN_H7_RF0_NBR * CAN_H7_ELEMENT_WORDS)

// Element-size code 0b000 = 8-byte data field (classic CAN).
#define CAN_H7_ESC_CODE_8B          (0U)

#define CAN_RX_ELEMENT_BYTES        (CAN_H7_ELEMENT_WORDS * 4U)
#define CAN_TX_ELEMENT_BYTES        (CAN_H7_ELEMENT_WORDS * 4U)

#endif

// Per-instance base address of Message RAM. On all supported families the
// regions are laid out contiguously from SRAMCAN_BASE in device-index order.
static uint32_t canMessageRamBase(canDevice_e device)
{
#if defined(STM32G4) || defined(STM32C5)
    return SRAMCAN_BASE + (uint32_t)device * CAN_SRAM_PER_INSTANCE;
#elif defined(STM32H7)
    return SRAMCAN_BASE + (uint32_t)device * CAN_H7_PER_INSTANCE_WORDS * 4U;
#else
    UNUSED(device);
    return 0;
#endif
}

static uint32_t canRxElementAddress(canDevice_e device, uint32_t index)
{
#if defined(STM32G4) || defined(STM32C5)
    return canMessageRamBase(device) + CAN_SRAM_RF0SA + index * CAN_SRAM_RF_SIZE;
#elif defined(STM32H7)
    return canMessageRamBase(device)
         + CAN_H7_RF0_WORD_OFFSET * 4U
         + index * CAN_RX_ELEMENT_BYTES;
#else
    UNUSED(device); UNUSED(index);
    return 0;
#endif
}

static uint32_t canTxElementAddress(canDevice_e device, uint32_t index)
{
#if defined(STM32G4) || defined(STM32C5)
    return canMessageRamBase(device) + CAN_SRAM_TFQSA + index * CAN_SRAM_TFQ_SIZE;
#elif defined(STM32H7)
    return canMessageRamBase(device)
         + CAN_H7_TFQ_WORD_OFFSET * 4U
         + index * CAN_TX_ELEMENT_BYTES;
#else
    UNUSED(device); UNUSED(index);
    return 0;
#endif
}

